lib/tasks/sample.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def self.mail
    # 実行したいコードを書く
    @users =  User.all
    @users.each do |user|