lib/tasks/sendmail.rb

  def self.mail
    # 実行したいコードを書く
    @users =  User.all
    @users.each do |user|
---
SELECT "users".* FROM "users"